{"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Dense", "config": {"name": "hidden_enc_1", "trainable": true, "dtype": "float32", "units": 50, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "batch_input_shape": [null, 15]}}, {"class_name": "Dense", "config": {"name": "hidden_enc_2", "trainable": true, "dtype": "float32", "units": 50, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 14, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MultivariateNormalTriL", "config": {"name": "multivariate_normal_tri_l", "trainable": true, "dtype": "float32", "function": ["4wAAAAAAAAAABwAAAAQAAAAfAAAAc6IAAACIAXwAfAGOAX0CdAB8AmoBdAJqA4MCfQN8A3IohwBm\nAWQBZAKECG4CiAB9BHQEagV8AnwEZAONAn0FfAVqBoMAfQZ8BXwGXwd8A3KKfAZkBRkAagh8Bl8I\nfAZkBhkAagl8Bl8JfAZkBxkAagF8Bl8BfAZkCBkAagh8BV8IfAZkCRkAagl8BV8JbhB8BmoIfAVf\nCHwGagl8BV8JfAV8BmYCUwApCvpEV3JhcHMgYG1ha2VfZGlzdHJpYnV0aW9uX2ZuYCB0byByZXR1\ncm4gYm90aCBkaXN0IGFuZCBjb25jcmV0ZSB2YWx1ZS5jAQAAAAAAAAABAAAAAwAAABMAAABzDgAA\nAHQAagGIAHwAgwGDAVMAKQFOKQLaDHRlbnNvcl90dXBsZdoLVGVuc29yVHVwbGUpAdoBZCkB2hRj\nb252ZXJ0X3RvX3RlbnNvcl9mbqkA+n8vVXNlcnMvdGFubGlhbmd3ZWkvRGVza3RvcC9meXBfcmVw\nby90Zl8xL2xpYi9weXRob24zLjYvc2l0ZS1wYWNrYWdlcy90ZW5zb3JmbG93X3Byb2JhYmlsaXR5\nL3B5dGhvbi9sYXllcnMvZGlzdHJpYnV0aW9uX2xheWVyLnB52gg8bGFtYmRhPq4AAADzAAAAAHo6\nRGlzdHJpYnV0aW9uTGFtYmRhLl9faW5pdF9fLjxsb2NhbHM+Ll9mbi48bG9jYWxzPi48bGFtYmRh\nPikC2gxkaXN0cmlidXRpb25yBQAAAOkBAAAA6f////9yDAAAAHIMAAAAcgwAAAByDAAAACkK2gpp\nc2luc3RhbmNl2gVkdHlwZdoLY29sbGVjdGlvbnPaCFNlcXVlbmNl2gNkdGPaEF9UZW5zb3JDb2Vy\nY2libGXaBl92YWx1ZdoRX3RmcF9kaXN0cmlidXRpb27aBXNoYXBl2glnZXRfc2hhcGUpB1oFZmFy\nZ3PaB2Zrd2FyZ3NyBAAAAFoMdmFsdWVfaXNfc2VxWiRtYXliZV9jb21wb3NpdGVfY29udmVydF90\nb190ZW5zb3JfZm5yCgAAANoFdmFsdWUpAnIFAAAA2hRtYWtlX2Rpc3RyaWJ1dGlvbl9mbnIGAAAA\ncgcAAADaA19mbqkAAABzIgAAAAACCgEOAxQBBAECAQgHCAQGBAQBDAEMAQwBDAEOAggBCAE=\n", null, ["sample", "<lambda>"]], "function_type": "lambda", "module": "tensorflow_probability.python.layers.distribution_layer", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}, "make_distribution_fn": "gASVwgIAAAAAAACMF2Nsb3VkcGlja2xlLmNsb3VkcGlja2xllIwOX2ZpbGxfZnVuY3Rpb26Uk5Qo\naACMD19tYWtlX3NrZWxfZnVuY5STlGgAjA1fYnVpbHRpbl90eXBllJOUjAhDb2RlVHlwZZSFlFKU\nKEsBSwBLAUsESxNDDnQAagF8AIgAiAGDA1MAlE6FlIwWTXVsdGl2YXJpYXRlTm9ybWFsVHJpTJSM\nA25ld5SGlIwBdJSFlIx/L1VzZXJzL3RhbmxpYW5nd2VpL0Rlc2t0b3AvZnlwX3JlcG8vdGZfMS9s\naWIvcHl0aG9uMy42L3NpdGUtcGFja2FnZXMvdGVuc29yZmxvd19wcm9iYWJpbGl0eS9weXRob24v\nbGF5ZXJzL2Rpc3RyaWJ1dGlvbl9sYXllci5weZSMCDxsYW1iZGE+lE2BAUMAlIwKZXZlbnRfc2l6\nZZSMDXZhbGlkYXRlX2FyZ3OUhpQpdJRSlEsCfZQojAtfX3BhY2thZ2VfX5SMJHRlbnNvcmZsb3df\ncHJvYmFiaWxpdHkucHl0aG9uLmxheWVyc5SMCF9fbmFtZV9flIw3dGVuc29yZmxvd19wcm9iYWJp\nbGl0eS5weXRob24ubGF5ZXJzLmRpc3RyaWJ1dGlvbl9sYXllcpSMCF9fZmlsZV9flGgRdYeUUpR9\nlCiMB2dsb2JhbHOUfZRoDGgdaAyTlHOMCGRlZmF1bHRzlE6MBGRpY3SUfZSMDmNsb3N1cmVfdmFs\ndWVzlF2UKEsEiWWMBm1vZHVsZZRoHYwEbmFtZZRoEowDZG9jlE6MF19jbG91ZHBpY2tsZV9zdWJt\nb2R1bGVzlF2UjAhxdWFsbmFtZZSMMU11bHRpdmFyaWF0ZU5vcm1hbFRyaUwuX19pbml0X18uPGxv\nY2Fscz4uPGxhbWJkYT6UjAprd2RlZmF1bHRzlE51dFIu\n", "convert_to_tensor_fn": "sample"}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}