{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_x", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 15], "dtype": "float32", "sparse": false, "name": "input_x"}, "inbound_nodes": []}, {"name": "hidden_enc_1", "class_name": "Dense", "config": {"name": "hidden_enc_1", "trainable": true, "dtype": "float32", "units": 50, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_x", 0, 0, {}]]]}, {"name": "hidden_enc_2", "class_name": "Dense", "config": {"name": "hidden_enc_2", "trainable": true, "dtype": "float32", "units": 50, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_enc_1", 0, 0, {}]]]}, {"name": "z_mu", "class_name": "Dense", "config": {"name": "z_mu", "trainable": true, "dtype": "float32", "units": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_enc_2", 0, 0, {}]]]}, {"name": "z_log_var", "class_name": "Dense", "config": {"name": "z_log_var", "trainable": true, "dtype": "float32", "units": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_enc_2", 0, 0, {}]]]}, {"name": "KL_Divergence", "class_name": "KLDivergenceLayer", "config": {"name": "KL_Divergence", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["z_mu", 0, 0, {}], ["z_log_var", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcw4AAAB0AGoBZAF8ABQAgwFTACkCTmcAAAAAAADgPykC2gFL\n2gNleHApAdoBdKkAcgQAAAD6HjxpcHl0aG9uLWlucHV0LTctMTNkNGJkNGEyMGJjPtoIPGxhbWJk\nYT4JAAAAcwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["KL_Divergence", 0, 1, {}]]]}, {"name": "input_eps", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "float32", "sparse": false, "name": "input_eps"}, "inbound_nodes": []}, {"name": "multiply_1", "class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["lambda_1", 0, 0, {}], ["input_eps", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["KL_Divergence", 0, 0, {}], ["multiply_1", 0, 0, {}]]]}, {"name": "hidden_dec_2", "class_name": "Dense", "config": {"name": "hidden_dec_2", "trainable": true, "dtype": "float32", "units": 50, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "hidden_dec_1", "class_name": "Dense", "config": {"name": "hidden_dec_1", "trainable": true, "dtype": "float32", "units": 50, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_dec_2", 0, 0, {}]]]}, {"name": "x_pred_coordinates_mu", "class_name": "Dense", "config": {"name": "x_pred_coordinates_mu", "trainable": true, "dtype": "float32", "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_dec_1", 0, 0, {}]]]}, {"name": "x_pred_coordinates_log_var", "class_name": "Dense", "config": {"name": "x_pred_coordinates_log_var", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_dec_1", 0, 0, {}]]]}, {"name": "x_pred_binary", "class_name": "Dense", "config": {"name": "x_pred_binary", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_dec_1", 0, 0, {}]]]}, {"name": "x_pred_categorical", "class_name": "Dense", "config": {"name": "x_pred_categorical", "trainable": true, "dtype": "float32", "units": 11, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_dec_1", 0, 0, {}]]]}, {"name": "x_pred_review_log_lambda_layer", "class_name": "Dense", "config": {"name": "x_pred_review_log_lambda_layer", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_dec_1", 0, 0, {}]]]}, {"name": "x_pred_coordinates", "class_name": "Concatenate", "config": {"name": "x_pred_coordinates", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["x_pred_coordinates_mu", 0, 0, {}], ["x_pred_coordinates_log_var", 0, 0, {}]]]}], "input_layers": [["input_x", 0, 0], ["input_eps", 0, 0]], "output_layers": [["x_pred_binary", 0, 0], ["x_pred_categorical", 0, 0], ["x_pred_review_log_lambda_layer", 0, 0], ["x_pred_coordinates", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}