{"class_name": "Model", "config": {"name": "model_7", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 15], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_x"}, "name": "input_x", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "hidden_enc_1", "trainable": true, "dtype": "float32", "units": 50, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "hidden_enc_1", "inbound_nodes": [[["input_x", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "hidden_enc_2", "trainable": true, "dtype": "float32", "units": 50, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "hidden_enc_2", "inbound_nodes": [[["hidden_enc_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "z_mu", "trainable": true, "dtype": "float32", "units": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "z_mu", "inbound_nodes": [[["hidden_enc_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "z_log_var", "trainable": true, "dtype": "float32", "units": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "z_log_var", "inbound_nodes": [[["hidden_enc_2", 0, 0, {}]]]}, {"class_name": "KLDivergenceLayer", "config": {"name": "KL_Divergence", "trainable": true, "dtype": "float32"}, "name": "KL_Divergence", "inbound_nodes": [[["z_mu", 0, 0, {}], ["z_log_var", 0, 0, {}]]]}], "input_layers": [["input_x", 0, 0]], "output_layers": [["KL_Divergence", 0, 0], ["KL_Divergence", 0, 1]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}