{"class_name": "Model", "config": {"name": "model_11", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 15], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_x"}, "name": "input_x", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "hidden_enc_1", "trainable": true, "dtype": "float32", "units": 50, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "hidden_enc_1", "inbound_nodes": [[["input_x", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "hidden_enc_2", "trainable": true, "dtype": "float32", "units": 50, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "hidden_enc_2", "inbound_nodes": [[["hidden_enc_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "z_probability_distribution", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "z_probability_distribution", "inbound_nodes": [[["hidden_enc_2", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_11", "layers": [{"class_name": "IndependentNormal", "config": {"name": "sample_layer", "trainable": true, "dtype": "float32", "function": ["4wAAAAAAAAAABwAAAAQAAAAfAAAAc6IAAACIAXwAfAGOAX0CdAB8AmoBdAJqA4MCfQN8A3IohwBm\nAWQBZAKECG4CiAB9BHQEagV8AnwEZAONAn0FfAVqBoMAfQZ8BXwGXwd8A3KKfAZkBRkAagh8Bl8I\nfAZkBhkAagl8Bl8JfAZkBxkAagF8Bl8BfAZkCBkAagh8BV8IfAZkCRkAagl8BV8JbhB8BmoIfAVf\nCHwGagl8BV8JfAV8BmYCUwApCvpEV3JhcHMgYG1ha2VfZGlzdHJpYnV0aW9uX2ZuYCB0byByZXR1\ncm4gYm90aCBkaXN0IGFuZCBjb25jcmV0ZSB2YWx1ZS5jAQAAAAAAAAABAAAAAwAAABMAAABzDgAA\nAHQAagGIAHwAgwGDAVMAKQFOKQLaDHRlbnNvcl90dXBsZdoLVGVuc29yVHVwbGUpAdoBZCkB2hRj\nb252ZXJ0X3RvX3RlbnNvcl9mbqkA+n8vVXNlcnMvdGFubGlhbmd3ZWkvRGVza3RvcC9meXBfcmVw\nby90Zl8xL2xpYi9weXRob24zLjYvc2l0ZS1wYWNrYWdlcy90ZW5zb3JmbG93X3Byb2JhYmlsaXR5\nL3B5dGhvbi9sYXllcnMvZGlzdHJpYnV0aW9uX2xheWVyLnB52gg8bGFtYmRhPq4AAADzAAAAAHo6\nRGlzdHJpYnV0aW9uTGFtYmRhLl9faW5pdF9fLjxsb2NhbHM+Ll9mbi48bG9jYWxzPi48bGFtYmRh\nPikC2gxkaXN0cmlidXRpb25yBQAAAOkBAAAA6f////9yDAAAAHIMAAAAcgwAAAByDAAAACkK2gpp\nc2luc3RhbmNl2gVkdHlwZdoLY29sbGVjdGlvbnPaCFNlcXVlbmNl2gNkdGPaEF9UZW5zb3JDb2Vy\nY2libGXaBl92YWx1ZdoRX3RmcF9kaXN0cmlidXRpb27aBXNoYXBl2glnZXRfc2hhcGUpB1oFZmFy\nZ3PaB2Zrd2FyZ3NyBAAAAFoMdmFsdWVfaXNfc2VxWiRtYXliZV9jb21wb3NpdGVfY29udmVydF90\nb190ZW5zb3JfZm5yCgAAANoFdmFsdWUpAnIFAAAA2hRtYWtlX2Rpc3RyaWJ1dGlvbl9mbnIGAAAA\ncgcAAADaA19mbqkAAABzIgAAAAACCgEOAxQBBAECAQgHCAQGBAQBDAEMAQwBDAEOAggBCAE=\n", null, ["sample", "<lambda>"]], "function_type": "lambda", "module": "tensorflow_probability.python.layers.distribution_layer", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}, "make_distribution_fn": "gASVuQIAAAAAAACMF2Nsb3VkcGlja2xlLmNsb3VkcGlja2xllIwOX2ZpbGxfZnVuY3Rpb26Uk5Qo\naACMD19tYWtlX3NrZWxfZnVuY5STlGgAjA1fYnVpbHRpbl90eXBllJOUjAhDb2RlVHlwZZSFlFKU\nKEsBSwBLAUsESxNDDnQAagF8AIgAiAGDA1MAlE6FlIwRSW5kZXBlbmRlbnROb3JtYWyUjANuZXeU\nhpSMAXSUhZSMfy9Vc2Vycy90YW5saWFuZ3dlaS9EZXNrdG9wL2Z5cF9yZXBvL3RmXzEvbGliL3B5\ndGhvbjMuNi9zaXRlLXBhY2thZ2VzL3RlbnNvcmZsb3dfcHJvYmFiaWxpdHkvcHl0aG9uL2xheWVy\ncy9kaXN0cmlidXRpb25fbGF5ZXIucHmUjAg8bGFtYmRhPpRN0ANDAJSMC2V2ZW50X3NoYXBllIwN\ndmFsaWRhdGVfYXJnc5SGlCl0lFKUSwJ9lCiMC19fcGFja2FnZV9flIwkdGVuc29yZmxvd19wcm9i\nYWJpbGl0eS5weXRob24ubGF5ZXJzlIwIX19uYW1lX1+UjDd0ZW5zb3JmbG93X3Byb2JhYmlsaXR5\nLnB5dGhvbi5sYXllcnMuZGlzdHJpYnV0aW9uX2xheWVylIwIX19maWxlX1+UaBF1h5RSlH2UKIwH\nZ2xvYmFsc5R9lGgMaB1oDJOUc4wIZGVmYXVsdHOUTowEZGljdJR9lIwOY2xvc3VyZV92YWx1ZXOU\nXZQoSwSJZYwGbW9kdWxllGgdjARuYW1llGgSjANkb2OUTowXX2Nsb3VkcGlja2xlX3N1Ym1vZHVs\nZXOUXZSMCHF1YWxuYW1llIwsSW5kZXBlbmRlbnROb3JtYWwuX19pbml0X18uPGxvY2Fscz4uPGxh\nbWJkYT6UjAprd2RlZmF1bHRzlE51dFIu\n", "convert_to_tensor_fn": "sample", "event_shape": 4, "validate_args": false, "batch_input_shape": [null, 8]}}]}, "name": "sequential_11", "inbound_nodes": [[["z_probability_distribution", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "hidden_dec_2", "trainable": true, "dtype": "float32", "units": 50, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "hidden_dec_2", "inbound_nodes": [[["sequential_11", 1, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "hidden_dec_1", "trainable": true, "dtype": "float32", "units": 50, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "hidden_dec_1", "inbound_nodes": [[["hidden_dec_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "x_pred_categorical", "trainable": true, "dtype": "float32", "units": 11, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "x_pred_categorical", "inbound_nodes": [[["hidden_dec_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "x_pred_binary", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "x_pred_binary", "inbound_nodes": [[["hidden_dec_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": "float32", "activation": "softmax"}, "name": "activation_1", "inbound_nodes": [[["x_pred_categorical", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "x_pred_review_log_lambda_layer", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "x_pred_review_log_lambda_layer", "inbound_nodes": [[["hidden_dec_1", 0, 0, {}]]]}, {"class_name": "MDN", "config": {"name": "x_pred_coordinates_mdn_layer", "trainable": true, "dtype": "float32", "output_dimension": 2, "num_mixtures": 10}, "name": "x_pred_coordinates_mdn_layer", "inbound_nodes": [[["hidden_dec_1", 0, 0, {}]]]}], "input_layers": [["input_x", 0, 0]], "output_layers": [["x_pred_binary", 0, 0], ["activation_1", 0, 0], ["x_pred_review_log_lambda_layer", 0, 0], ["x_pred_coordinates_mdn_layer", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}