{"class_name": "Model", "config": {"name": "model_5", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "float32", "sparse": false, "ragged": false, "name": "decode_input"}, "name": "decode_input", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "hidden_dec_2", "trainable": true, "dtype": "float32", "units": 50, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "hidden_dec_2", "inbound_nodes": [[["decode_input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "hidden_dec_1", "trainable": true, "dtype": "float32", "units": 50, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "hidden_dec_1", "inbound_nodes": [[["hidden_dec_2", 0, 0, {}]]]}, {"class_name": "MDN", "config": {"name": "x_pred_coordinates_mdn_layer", "trainable": true, "dtype": "float32", "output_dimension": 2, "num_mixtures": 10}, "name": "x_pred_coordinates_mdn_layer", "inbound_nodes": [[["hidden_dec_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "x_pred_review_log_lambda_layer", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "x_pred_review_log_lambda_layer", "inbound_nodes": [[["hidden_dec_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "x_pred_categorical", "trainable": true, "dtype": "float32", "units": 11, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "x_pred_categorical", "inbound_nodes": [[["hidden_dec_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "x_pred_binary", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "x_pred_binary", "inbound_nodes": [[["hidden_dec_1", 0, 0, {}]]]}], "input_layers": [["decode_input", 0, 0]], "output_layers": [["x_pred_coordinates_mdn_layer", 0, 0], ["x_pred_review_log_lambda_layer", 0, 0], ["x_pred_categorical", 0, 0], ["x_pred_binary", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}