{"class_name": "Model", "config": {"name": "model_4", "layers": [{"name": "input_x", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 15], "dtype": "float32", "sparse": false, "name": "input_x"}, "inbound_nodes": []}, {"name": "hidden_enc_1", "class_name": "Dense", "config": {"name": "hidden_enc_1", "trainable": true, "dtype": "float32", "units": 50, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_x", 0, 0, {}]]]}, {"name": "hidden_enc_2", "class_name": "Dense", "config": {"name": "hidden_enc_2", "trainable": true, "dtype": "float32", "units": 50, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_enc_1", 0, 0, {}]]]}, {"name": "z_mu", "class_name": "Dense", "config": {"name": "z_mu", "trainable": true, "dtype": "float32", "units": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_enc_2", 0, 0, {}]]]}, {"name": "z_log_var", "class_name": "Dense", "config": {"name": "z_log_var", "trainable": true, "dtype": "float32", "units": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_enc_2", 0, 0, {}]]]}, {"name": "KL_Divergence", "class_name": "KLDivergenceLayer", "config": {"name": "KL_Divergence", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["z_mu", 0, 0, {}], ["z_log_var", 0, 0, {}]]]}], "input_layers": [["input_x", 0, 0]], "output_layers": [["KL_Divergence", 0, 0], ["KL_Divergence", 0, 1]]}, "keras_version": "2.3.1", "backend": "tensorflow"}