{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "decode_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "float32", "sparse": false, "name": "decode_input"}, "inbound_nodes": []}, {"name": "hidden_dec_2", "class_name": "Dense", "config": {"name": "hidden_dec_2", "trainable": true, "dtype": "float32", "units": 50, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["decode_input", 0, 0, {}]]]}, {"name": "hidden_dec_1", "class_name": "Dense", "config": {"name": "hidden_dec_1", "trainable": true, "dtype": "float32", "units": 50, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_dec_2", 0, 0, {}]]]}, {"name": "x_pred_coordinates_mu", "class_name": "Dense", "config": {"name": "x_pred_coordinates_mu", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_dec_1", 0, 0, {}]]]}, {"name": "x_pred_coordinates_log_var", "class_name": "Dense", "config": {"name": "x_pred_coordinates_log_var", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_dec_1", 0, 0, {}]]]}, {"name": "x_pred_coordinates", "class_name": "Concatenate", "config": {"name": "x_pred_coordinates", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["x_pred_coordinates_mu", 0, 0, {}], ["x_pred_coordinates_log_var", 0, 0, {}]]]}, {"name": "x_pred_review_log_lambda_layer", "class_name": "Dense", "config": {"name": "x_pred_review_log_lambda_layer", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_dec_1", 0, 0, {}]]]}, {"name": "x_pred_categorical", "class_name": "Dense", "config": {"name": "x_pred_categorical", "trainable": true, "dtype": "float32", "units": 11, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_dec_1", 0, 0, {}]]]}, {"name": "x_pred_binary", "class_name": "Dense", "config": {"name": "x_pred_binary", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_dec_1", 0, 0, {}]]]}], "input_layers": [["decode_input", 0, 0]], "output_layers": [["x_pred_coordinates", 0, 0], ["x_pred_review_log_lambda_layer", 0, 0], ["x_pred_categorical", 0, 0], ["x_pred_binary", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}